In [2]:
print('hello')

hello

In [1]:
print('testing pushing to github')

testing pushing to github

In [2]:
print("last test pushing to github")

last test pushing to github

In [1]:
import pandas as pd

In [6]:
import numpy as np

In [ ]:
# Importing data from a flat file (.csv)

In [3]:
titanic = pd.read_csv('titanic_dataset.csv', index_col=0)

In [4]:
titanic.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
# Retrieving data using online SQL